# Pandas_7  Concat Dataframes
<hr>

In [45]:
%%HTML
<iframe width="560" height="315" src="https://www.youtube.com/embed/WGOEFok1szA?si=Uw5GmF1MFM05mG4E" title="YouTube video player" frameborder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share" referrerpolicy="strict-origin-when-cross-origin" allowfullscreen></iframe>

In [1]:
import pandas as pd

In [3]:
import pandas as pd

# Create a sample DataFrame
data = {
    'Name': ['John', 'Jane', 'Bob', 'Alice'],
    'Age': [25, 30, 35, 40],
    'Gender': ['Male', 'Female', 'Male', 'Female']
}
df = pd.DataFrame(data)

# Apply the border style to the DataFrame
styled_df = df.style.set_properties(**{
    'border': '1px solid white'
})

# Display the styled DataFrame
display(styled_df)

In [13]:
india_weather =pd.DataFrame({
    "city": ["Mumbai", "Delhi", "Banglore"],
    "temperature": [32,45,30],
    "humidity": [80, 60, 78]
})
india_weather

       city  temperature  humidity
0    Mumbai           32        80
1     Delhi           45        60
2  Banglore           30        78

In [14]:
us_weather =pd.DataFrame({
    "city": ["NYC", "Chicago", "Orlando"],
    "temperature": [21,14,35],
    "humidity": [68, 65, 75]
})
us_weather

      city  temperature  humidity
0      NYC           21        68
1  Chicago           14        65
2  Orlando           35        75

In [15]:
df=pd.concat([india_weather,us_weather])
df
#concatenates two dataframes but here indexing is so bad

       city  temperature  humidity
0    Mumbai           32        80
1     Delhi           45        60
2  Banglore           30        78
0       NYC           21        68
1   Chicago           14        65
2   Orlando           35        75

In [16]:
df2=pd.concat([india_weather,us_weather],ignore_index=True)
df2

       city  temperature  humidity
0    Mumbai           32        80
1     Delhi           45        60
2  Banglore           30        78
3       NYC           21        68
4   Chicago           14        65
5   Orlando           35        75

In [17]:
df3=df3=pd.concat([india_weather,us_weather],keys=["IND","US"])
df3 #here ignore_idx never works bcoz as you are dividing them then there is no concept of ignore_index

           city  temperature  humidity
IND 0    Mumbai           32        80
    1     Delhi           45        60
    2  Banglore           30        78
US  0       NYC           21        68
    1   Chicago           14        65
    2   Orlando           35        75

In [18]:
df3.loc["IND"]

       city  temperature  humidity
0    Mumbai           32        80
1     Delhi           45        60
2  Banglore           30        78

In [19]:
df3.loc["US"]

      city  temperature  humidity
0      NYC           21        68
1  Chicago           14        65
2  Orlando           35        75

In [34]:
temperature_df=pd.DataFrame({
    "city": ["Mumbai", "Delhi", "Banglore"],
    "temperature": [32,45,30],
},index=[0,1,2])
temperature_df

       city  temperature
0    Mumbai           32
1     Delhi           45
2  Banglore           30

In [36]:
windspeed_df=pd.DataFrame({
    "city": ["Delhi", "Mumbai"],
    "windpeed": [80, 60]
},index=[1,0])
windspeed_df #for a dataframe we can indexing to that in order to get placed normally

     city  windpeed
1   Delhi        80
0  Mumbai        60

In [37]:
df3=pd.concat([temperature_df,windspeed_df])
df3 #so here by defaultaxis=0

       city  temperature  windpeed
0    Mumbai         32.0       NaN
1     Delhi         45.0       NaN
2  Banglore         30.0       NaN
1     Delhi          NaN      80.0
0    Mumbai          NaN      60.0

In [39]:
df4=pd.concat([temperature_df,windspeed_df],axis=1)
df4 #now this is pretty good looking

       city  temperature    city  windpeed
0    Mumbai           32  Mumbai      60.0
1     Delhi           45   Delhi      80.0
2  Banglore           30     NaN       NaN

In [40]:
#there is an other way for adding or concatenating i.e pandas series

In [41]:
series=pd.Series(["Humid","Dry","Rain"],name="event")
series

0    Humid
1      Dry
2     Rain
Name: event, dtype: object

In [42]:
temperature_df

       city  temperature
0    Mumbai           32
1     Delhi           45
2  Banglore           30

In [43]:
df5=pd.concat([temperature_df,series],axis=1)
df5

       city  temperature  event
0    Mumbai           32  Humid
1     Delhi           45    Dry
2  Banglore           30   Rain

In [44]:
#end of seesion

In [46]:
#here the indexing system is very bad bcoz when we ahve millions of data then it will be considered as waste of writing numbers which was very bad for this there is a method called merge which is in Pandas_8